POSTTEST 2
KECERDASAN BUATAN

NAMA    : RIANAWATI

NIM     : 2009106132

KELAS   : C2 2020

In [3]:
import pandas as pd
import numpy as np
from tabulate import tabulate

TAMPIL DATASET

In [4]:
dataset =pd.read_csv('netflix_titles.csv')
dataset

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...
...,...,...,...,...,...,...,...,...,...,...,...,...
8802,s8803,Movie,Zodiac,David Fincher,"Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...",United States,"November 20, 2019",2007,R,158 min,"Cult Movies, Dramas, Thrillers","A political cartoonist, a crime reporter and a..."
8803,s8804,TV Show,Zombie Dumb,NaN,NaN,NaN,"July 1, 2019",2018,TV-Y7,2 Seasons,"Kids' TV, Korean TV Shows, TV Comedies","While living alone in a spooky town, a young g..."
8804,s8805,Movie,Zombieland,Ruben Fleischer,"Jesse Eisenberg, Woody Harrelson, Emma Stone, ...",United States,"November 1, 2019",2009,R,88 min,"Comedies, Horror Movies",Looking to survive in a world taken over by zo...
8805,s8806,Movie,Zoom,Peter Hewitt,"Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...",United States,"January 11, 2020",2006,PG,88 min,"Children & Family Movies, Comedies","Dragged from civilian life, a former superhero..."
8806,s8807,Movie,Zubaan,Mozez Singh,"Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanan...",India,"March 2, 2019",2015,TV-14,111 min,"Dramas, International Movies, Music & Musicals",A scrappy but poor boy worms his way into a ty...

INFO DATASET

In [5]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
 11  description   8807 non-null   object
dtypes: int64(1), object(11)
memory usage: 825.8+ KB

JUMLAH RECORD

In [6]:
Jumlah_Record = len(dataset.index)
print("Jumlah Record", Jumlah_Record)

Jumlah Record 8807

NAMA ATRIBUT

In [7]:
Data_Atribut = list(dataset.columns)
Nama_Atribut = "\n".join(Data_Atribut)
print("Nama Atribut :\n",Nama_Atribut)

Nama Atribut :
 show_id
type
title
director
cast
country
date_added
release_year
rating
duration
listed_in
description

JUMLAH ATRIBUT

In [8]:
Jumlah_Atribut = dataset.shape[1]
print("Jumlah Atribut", Jumlah_Atribut)

Jumlah Atribut 12

ATRIBUT TIPE OBJEK

In [9]:
Objek = len(dataset.dtypes[dataset.dtypes =='object'])
print("Jumlah Atribut dengan tipe objek =", Objek)

Jumlah Atribut dengan tipe objek = 11

ATRIBUT TIPE ANGKA

In [10]:
Int = len(dataset.dtypes[dataset.dtypes == 'int64'])
Float = len(dataset.dtypes[dataset.dtypes == 'float64'])
Angka = Int + Float
print("Jumlah Atribut dengan tipe Angka=", Angka)

Jumlah Atribut dengan tipe Angka= 1

ATRIBUT NILAI NULL

In [11]:
Null = dataset.isnull().any().sum()
print("Jumlah Atribut yang memiliki nilai null =", Null)

Jumlah Atribut yang memiliki nilai null = 6

TAMPILAN DALAM DICTIONARY

In [12]:
Dict= {
    "Jumlah Record" : [Jumlah_Atribut],
    "Nama Atribut"  :[Nama_Atribut],
    "Atribut Tipe Object": [Objek],
    "Atribut Tipe Angka" : [Angka],
    "Atribut Nilai NULL" : [Null],
}
tabel = pd.DataFrame(Dict)
print(tabulate(tabel, headers ='keys', tablefmt='psql', showindex=False))

+-----------------+----------------+-----------------------+----------------------+----------------------+
|   Jumlah Record | Nama Atribut   |   Atribut Tipe Object |   Atribut Tipe Angka |   Atribut Nilai NULL |
|-----------------+----------------+-----------------------+----------------------+----------------------|
|              12 | show_id        |                    11 |                    1 |                    6 |
|                 | type           |                       |                      |                      |
|                 | title          |                       |                      |                      |
|                 | director       |                       |                      |                      |
|                 | cast           |                       |                      |                      |
|                 | country        |                       |                      |                      |
|                 | date_added     |                       |                      |                      |
|                 | release_year   |                       |                      |                      |
|                 | rating         |                       |                      |                      |
|                 | duration       |                       |                      |                      |
|                 | listed_in      |                       |                      |                      |
|                 | description    |                       |                      |                      |
+-----------------+----------------+-----------------------+----------------------+----------------------+

Rata-rata, Standar Deviasi, Nilai Maksimum, Q1, Q2, dan Q3 dari Atribut Bertipe Angka

In [13]:
desc = dataset.describe()
desc.rename(index = {"count" : "Jumlah Data", "Mean" : "Rata Rata", "std": "Standar Deviasi",
                     "min" : "Nilai Minimum", "25%": "Q1", "50%": "Q2", "75%": "Q3", "max": "Nilai Maksimal"},inplace = True)
desc

                 release_year
Jumlah Data       8807.000000
mean              2014.180198
Standar Deviasi      8.819312
Nilai Minimum     1925.000000
Q1                2013.000000
Q2                2017.000000
Q3                2019.000000
Nilai Maksimal    2021.000000

NILAI KORELASI

In [14]:
dataset.corr()

              release_year
release_year           1.0

ATRIBUT BERTIPE ANGKA MENJADI DESIMAL 3 ANGKA DIBELAKANG KOMA

In [15]:
dataset['release_year']*0.001

0       2.020
1       2.021
2       2.021
3       2.021
4       2.021
        ...
8802    2.007
8803    2.018
8804    2.009
8805    2.006
8806    2.015
Name: release_year, Length: 8807, dtype: float64

10 RECORD PERTAMA BERTIPE ANGKA

In [2]:
numerics = ['int64', 'float64']
number = dataset.select_dtypes(include=numerics).copy()
number.head(10)

NameError: name 'dataset' is not defined

MENYIMPAN DATASET DENGAN ATRIBUT BERTIPE ANGKA KE DALAM FILE CSV

In [1]:
number.to_csv('netflix_titles.csv')

NameError: name 'number' is not defined